ErichStyger/mcuoneclipse/Examples/MCUXpresso/FRDM-KW41Z/hid_device_frdmkw41z/framework/MemManager/Source/MemManager.c
        /* Add block size (without list header)*/
      pHeap += pPoolInfo->blockSize + sizeof(listHeader_t);
      poolN--;
    }

    pPools->blockSize = pPoolInfo->blockSize;
    pPools->poolId = pPoolInfo->poolId;
    pPools->nextBlockSize = (pPoolInfo+1)->blockSize;
    if(pPools->nextBlockSize == 0)
    {
      break;
    }

    pPools++;
    pPoolInfo++;
  }

  return MEM_SUCCESS_c;
}

/*! *********************************************************************************
* \brief    This function returns the number of available blocks greater or
*           equal to the given size.
*
* \param[in] size - Size of blocks to check for availability.
*
* \return Number of available blocks greater or equal to the given size.
*
* \pre Memory manager must be previously initialized.
*
********************************************************************************** */
uint32_t MEM_GetAvailableBlocks
(
uint32_t size
)
{
    pools_t *pPools = memPools;
    uint32_t pTotalCount = 0;
    
    for(;;)
    {
        if(size <= pPools->blockSize)
        {
            pTotalCount += ListGetSize((listHandle_t)&pPools->anchor);
        }
        
        if(pPools->nextBlockSize == 0)
        {
            break;
        }
        
        pPools++;
    }
    
    return  pTotalCount;
}

/*! *********************************************************************************
* \brief     Allocate a block from the memory pools. The function uses the 
*            numBytes argument to look up a pool with adequate block sizes.
* \param[in] numBytes - Size of buffer to allocate.
*
* \return Pointer to the allocated buffer, NULL if failed.
*
* \pre Memory manager must be previously initialized.
*
********************************************************************************** */

/*! *********************************************************************************
* \brief     Allocate a block from the memory pools. The function uses the
*            numBytes argument to look up a pool with adequate block sizes.
* \param[in] numBytes - Size of buffer to allocate.
* \param[in] poolId - The ID of the pool where to search for a free buffer.
* \param[in] pCaller - pointer to the caller function (Debug purpose)
*
* \return Pointer to the allocated buffer, NULL if failed.
*
* \pre Memory manager must be previously initialized.
*
********************************************************************************** */
void* MEM_BufferAllocWithId
(
uint32_t numBytes,
uint8_t  poolId,
void *pCaller
)
{
#ifdef MEM_TRACKING
    /* Save the Link Register */
    volatile uint32_t savedLR = (uint32_t) __get_LR();
    uint16_t requestedSize = numBytes;
    bool_t allocFailure = FALSE;
#endif /*MEM_TRACKING*/
    
    pools_t *pPools = memPools;
    listHeader_t *pBlock;

    OSA_InterruptDisable();
    
    while(numBytes)
    {
        if( (numBytes <= pPools->blockSize) && (poolId == pPools->poolId) )
        {
            pBlock = (listHeader_t *)ListRemoveHead((listHandle_t)&pPools->anchor);
            
            if(NULL != pBlock)
            {
                pBlock++;
                gFreeMessagesCount--;
                pPools->allocatedBlocks++;
                
#ifdef MEM_STATISTICS
                if(gFreeMessagesCount < gFreeMessagesCountMin)
                {
                    gFreeMessagesCountMin = gFreeMessagesCount;
                }
                
                pPools->poolStatistics.allocatedBlocks++;
                if ( pPools->poolStatistics.allocatedBlocks > pPools->poolStatistics.allocatedBlocksPeak )
                {
                    pPools->poolStatistics.allocatedBlocksPeak = pPools->poolStatistics.allocatedBlocks;
                }
                MEM_ASSERT(pPools->poolStatistics.allocatedBlocks <= pPools->poolStatistics.numBlocks);
#endif /*MEM_STATISTICS*/
                
#ifdef MEM_TRACKING
                MEM_Track(pBlock, MEM_TRACKING_ALLOC_c, savedLR, requestedSize, pCaller);
#endif /*MEM_TRACKING*/
                OSA_InterruptEnable();
                return pBlock;
            }
            else
            {
#ifdef MEM_STATISTICS
                if(!allocFailure)
                {
                    pPools->poolStatistics.allocationFailures++;
                    allocFailure = TRUE;
                }
#endif /*MEM_STATISTICS*/
                if(numBytes > pPools->nextBlockSize) 
                {
                    break;
                }
                /* No more blocks of that size, try next size. */
                numBytes = pPools->nextBlockSize;   
            }
        }
        /* Try next pool*/
        if(pPools->nextBlockSize)
        {
            pPools++;
        }
        else
        {
            numBytes = 0;
        }
    }
    
#ifdef MEM_DEBUG_OUT_OF_MEMORY
    panic( 0, (uint32_t)MEM_BufferAllocWithId, 0, 0);
#endif
    
    OSA_InterruptEnable();
    return NULL;
}

/*! *********************************************************************************
* \brief     Deallocate a memory block by putting it in the corresponding pool
*            of free blocks.
*
* \param[in] buffer - Pointer to buffer to deallocate.
*
* \return MEM_SUCCESS_c if deallocation was successful, MEM_FREE_ERROR_c if not.
*
* \pre Memory manager must be previously initialized.
*
* \remarks Never deallocate the same buffer twice.
*
********************************************************************************** */
memStatus_t MEM_BufferFree
(
void* buffer /* IN: Block of memory to free*/
)
{
#ifdef MEM_TRACKING
    /* Save the Link Register */
    volatile uint32_t savedLR = (uint32_t) __get_LR();
#endif /*MEM_TRACKING*/
    listHeader_t *pHeader;
    pools_t *pParentPool;
    pools_t *pool;
    
    if( buffer == NULL )
    {
        return MEM_FREE_ERROR_c;
    }
    
    pHeader = (listHeader_t *)buffer-1;
    
    if( ((uint8_t*)pHeader < (uint8_t*)memHeap) || ((uint8_t*)pHeader > ((uint8_t*)memHeap + sizeof(memHeap))) )
    {
#ifdef MEM_DEBUG_INVALID_POINTERS
        panic( 0, (uint32_t)MEM_BufferFree, 0, 0);
#endif
        return MEM_FREE_ERROR_c;
    }

    OSA_InterruptDisable();
    
    pParentPool = (pools_t *)pHeader->pParentPool;
    pool = memPools;

    for(;;)
    {
        if (pParentPool == pool)
        {
            break;
        }
        if(pool->nextBlockSize == 0)
        {
            /* The parent pool was not found! This means that the memory buffer is corrupt or
            that the MEM_BufferFree() function was called with an invalid parameter */
#ifdef MEM_STATISTICS
            pParentPool->poolStatistics.freeFailures++;
#endif /*MEM_STATISTICS*/
            OSA_InterruptEnable();
#ifdef MEM_DEBUG_INVALID_POINTERS
            panic( 0, (uint32_t)MEM_BufferFree, 0, 0);
#endif
            return MEM_FREE_ERROR_c;
        }
        pool++;
    }
    
    if( pHeader->link.list != NULL )
    {
        /* The memory buffer appears to be enqueued in a linked list.
        This list may be the free memory buffers pool, or another list. */
#ifdef MEM_STATISTICS
        pParentPool->poolStatistics.freeFailures++;
#endif /*MEM_STATISTICS*/
        OSA_InterruptEnable();
#ifdef MEM_DEBUG_INVALID_POINTERS
        panic( 0, (uint32_t)MEM_BufferFree, 0, 0);
#endif
        return MEM_FREE_ERROR_c;
    }
    
    gFreeMessagesCount++;
    
    ListAddTail((listHandle_t)&pParentPool->anchor, (listElementHandle_t)&pHeader->link);
    pParentPool->allocatedBlocks--;
    
#ifdef MEM_STATISTICS
    MEM_ASSERT(pParentPool->poolStatistics.allocatedBlocks > 0);
    pParentPool->poolStatistics.allocatedBlocks--;
#endif /*MEM_STATISTICS*/
    
#ifdef MEM_TRACKING
    MEM_Track(buffer, MEM_TRACKING_FREE_c, savedLR, 0, NULL);
#endif /*MEM_TRACKING*/
    OSA_InterruptEnable();
    return MEM_SUCCESS_c;
}

/*! *********************************************************************************
* \brief     Determines the size of a memory block
*
* \param[in] buffer - Pointer to buffer.
*
* \return size of memory block
*
* \pre Memory manager must be previously initialized.
*
********************************************************************************** */
uint16_t MEM_BufferGetSize
(
void* buffer /* IN: Block of memory to free*/
)
{
    if( buffer )
    {
        return ((pools_t *)((listHeader_t *)buffer-1)->pParentPool)->blockSize;
    }

