ErichStyger/mcuoneclipse/Examples/MCUXpresso/FRDM-KW41Z/hid_device_frdmkw41z/framework/MemManager/Source/MemManager.c
    return 0;
}

/*! *********************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
********************************************************************************** */
/*! *********************************************************************************
* \brief     This function updates the tracking array element corresponding to the given
*            block.
*
* \param[in] block - Pointer to the block.
* \param[in] alloc - Indicates whether an allocation or free operation was performed
* \param[in] address - Address where MEM_BufferAlloc or MEM_BufferFree was called
* \param[in] requestedSize - Indicates the requested buffer size  passed to MEM_BufferAlloc.
*                            Has no use if a free operation was performed.
*
* \return Returns TRUE if correct allocation or dealocation was performed, FALSE if a
*         buffer was allocated or freed twice.
*
********************************************************************************** */
#ifdef MEM_TRACKING
uint8_t MEM_Track(listHeader_t *block, memTrackingStatus_t alloc, uint32_t address, uint16_t requestedSize, void *pCaller)
{
  uint16_t i;
  blockTracking_t *pTrack = NULL;
#ifdef MEM_STATISTICS
  poolStat_t * poolStatistics = (poolStat_t *)&((pools_t *)( (listElementHandle_t)(block-1)->pParentPool ))->poolStatistics;
#endif

  for( i=0; i<mTotalNoOfMsgs_c; i++ )
  {
      if( block == memTrack[i].blockAddr )
      {
          pTrack = &memTrack[i];
          break;
      }
  }

  if( !pTrack || pTrack->allocStatus == alloc)
  {
#ifdef MEM_DEBUG
      panic( 0, (uint32_t)MEM_Track, 0, 0);
#endif
      return FALSE;
  }

  pTrack->allocStatus = alloc;
  pTrack->pCaller = (void*)((uint32_t)pCaller & 0x7FFFFFFF);

  if(alloc == MEM_TRACKING_ALLOC_c)
  {
    pTrack->fragmentWaste = pTrack->blockSize - requestedSize;
    pTrack->allocCounter++;
    pTrack->allocAddr = (void *)address;
    if( (uint32_t)pCaller & 0x80000000 )
    {
        pTrack->timeStamp = 0xFFFFFFFF;
    }
    else
    {
        pTrack->timeStamp = MEM_GetTimeStamp();
    }
#ifdef MEM_STATISTICS
    gTotalFragmentWaste += pTrack->fragmentWaste;
    if(gTotalFragmentWaste > gMaxTotalFragmentWaste)
    {
        gMaxTotalFragmentWaste = gTotalFragmentWaste;
        FLib_MemCpy(&memPoolsSnapShot[0], &memPools[0], sizeof(memPools));
    }

    poolStatistics->poolFragmentWaste += pTrack->fragmentWaste;
    if(poolStatistics->poolFragmentWaste > poolStatistics->poolFragmentWastePeak)
      poolStatistics->poolFragmentWastePeak = poolStatistics->poolFragmentWaste;
    if(pTrack->fragmentWaste < poolStatistics->poolFragmentMinWaste)
    {
      poolStatistics->poolFragmentMinWaste = pTrack->fragmentWaste;
    }

    if(poolStatistics->allocatedBlocks == poolStatistics->numBlocks)
    {
          //__asm("BKPT #0\n") ; /* cause the debugger to stop */
    }
#endif /*MEM_STATISTICS*/
  }
  else
  {
#ifdef MEM_STATISTICS
    poolStatistics->poolFragmentWaste -= pTrack->fragmentWaste;
    gTotalFragmentWaste -= pTrack->fragmentWaste;
#endif /*MEM_STATISTICS*/

    pTrack->fragmentWaste = 0;
    pTrack->freeCounter++;
    pTrack->freeAddr = (void *)address;
    pTrack->timeStamp = 0;
  }

  return TRUE;
}

/*! *********************************************************************************
* \brief     This function checks for buffer overflow when copying multiple bytes
*
* \param[in] p    - pointer to destination.
* \param[in] size - number of bytes to copy
*
* \return 1 if overflow detected, else 0
*
********************************************************************************** */
uint8_t MEM_BufferCheck(uint8_t *p, uint32_t size)
{
    poolInfo_t *pPollInfo = poolInfo;
    uint8_t* memAddr = memHeap;
    uint32_t poolBytes, blockBytes, i;

    if( (p < (uint8_t*)memHeap) || (p > ((uint8_t*)memHeap + sizeof(memHeap))) )
    {
        return 0;
    }

    while( pPollInfo->blockSize )
    {
        blockBytes = pPollInfo->blockSize + sizeof(listHeader_t);
        poolBytes  = blockBytes * pPollInfo->poolSize;

        /* Find the correct message pool */
        if( (p >= memAddr) && (p < memAddr + poolBytes) )
        {
            /* Check if the size to copy is greather then the size of the current block */
            if( size > pPollInfo->blockSize )
            {
#ifdef MEM_DEBUG
                panic(0,0,0,0);
#endif
                return 1;
            }

            /* Find the correct memory block */
            for( i=0; i<pPollInfo->poolSize; i++ )
            {
                if( (p >= memAddr) && (p < memAddr + blockBytes) )
                {
                    if( p + size > memAddr + blockBytes )
                    {
#ifdef MEM_DEBUG
                        panic(0,0,0,0);
#endif
                        return 1;
                    }
                    else
                    {
                        return 0;
                    }
                }

                memAddr += blockBytes;
            }
        }

        /* check next pool */
        memAddr += poolBytes;
        pPollInfo++;
    }

    return 0;
}
#endif /*MEM_TRACKING*/


/*! *********************************************************************************
* \brief     This function checks if the buffers are allocated for more than the 
*            specified duration
*
********************************************************************************** */
#ifdef MEM_TRACKING
void MEM_CheckIfMemBuffersAreFreed(void)
{
    uint32_t t;
    uint16_t i, j = 0;
    uint8_t trackCount = 0;
    pools_t *pParentPool;
    volatile blockTracking_t *pTrack;
    static volatile blockTracking_t *mpTrackTbl[NUM_OF_TRACK_PTR];
    static uint32_t lastTimestamp = 0;
    uint32_t currentTime = MEM_GetTimeStamp();
    
    if( (currentTime - lastTimestamp) >= MEM_CheckMemBufferInterval_c )
    {
        lastTimestamp = currentTime;
        j = 0;

        for( i = 0; i < mTotalNoOfMsgs_c; i++ )
        {
            OSA_InterruptDisable();
            
            /* Validate the pParent first */
            pParentPool = (((listHeader_t *)(memTrack[i].blockAddr))-1)->pParentPool;
            if(pParentPool != &memPools[j])
            {
                if(j < NumberOfElements(memPools))
                {
                    j++;
                    if(pParentPool != &memPools[j])
                    {
                        panic(0,0,0,0);
                    }
                }
                else
                {
                    panic(0,0,0,0);
                }
            }
            
            /* Check if it should be freed  */
            pTrack = &memTrack[i];
            if((pTrack->timeStamp != 0xffffffff ) &&
               (pTrack->allocStatus == MEM_TRACKING_ALLOC_c))
            {
                t = MEM_GetTimeStamp();
                t = t - pTrack->timeStamp;
                if( t > MEM_CheckMemBufferThreshold_c )
                {
                    mpTrackTbl[trackCount++] = pTrack;
                    if(trackCount == NUM_OF_TRACK_PTR)
                    {
                        (void)mpTrackTbl; /* remove compiler warnings */
                        panic(0,0,0,0);
                        break;
                    }
                }
            }
            OSA_InterruptEnable();
        } /* end for */
    }
}
#endif /*MEM_TRACKING*/

/*! *********************************************************************************
* \brief     Performs a write-read-verify test for every byte in all memory pools.
*
* \return Returns MEM_SUCCESS_c if test was successful, MEM_ALLOC_ERROR_c if a
*         buffer was not allocated successufuly, MEM_FREE_ERROR_c  if a
*         buffer was not freed successufuly or MEM_UNKNOWN_ERROR_c if a verify error,
*         heap overflow or data corruption occurred.
*
********************************************************************************** */
uint32_t MEM_WriteReadTest(void)
{
  uint8_t *data, count = 1;
  uintn32_t idx1,idx2,idx3;
  uint32_t freeMsgs;

  /*memory write test*/
  freeMsgs = MEM_GetAvailableBlocks(0);

  for(idx1=0; poolInfo[idx1].blockSize != 0; idx1++)
  {
    for(idx2=0; idx2 < poolInfo[idx1].poolSize; idx2++)
    {
      data = (uint8_t *)MEM_BufferAlloc(poolInfo[idx1].blockSize);

      if(data == NULL)
      {
        return MEM_ALLOC_ERROR_c;
      }

      for(idx3=0; idx3 < poolInfo[idx1].blockSize; idx3++)
      {
        if(data > memHeap + heapSize)
        {
          return MEM_UNKNOWN_ERROR_c;
        }
        *data = count & 0xff;
        data++;
      }
      count++;
    }
  }

  count = 1;
  data = memHeap;
  /*memory read test*/
  for(idx1=0; poolInfo[idx1].blockSize != 0; idx1++)
  {
    for(idx2=0; idx2 < poolInfo[idx1].poolSize; idx2++)
    {
      /*New block; jump over list header*/
      data = data + sizeof(listHeader_t);
      for(idx3=0; idx3<poolInfo[idx1].blockSize; idx3++)
      {
        if(*data == count)
        {
          data++;
        }
        else
        {
          return MEM_UNKNOWN_ERROR_c;
        }
      }
      if(MEM_BufferFree( data - poolInfo[idx1].blockSize) != MEM_SUCCESS_c)
      {
        return MEM_FREE_ERROR_c;
      }
      count++;
    }
  }
  if(MEM_GetAvailableBlocks(0) != freeMsgs)
  {
    return MEM_UNKNOWN_ERROR_c;
  }
#ifdef MEM_STATISTICS
  for(idx1 = 0; poolInfo[idx1].blockSize != 0; idx1++)
  {
    memPools[idx1].poolStatistics.allocatedBlocksPeak = 0;
  }
#endif /*MEM_STATISTICS*/

  return MEM_SUCCESS_c;
}
